# CreateSlab

## Description
Creates a slab.

```pascal
FUNCTION CreateSlab(profile : HANDLE): HANDLE;
```

```python
def vs.CreateSlab(profile):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|profile|HANDLE|The profile from which to create the slab.|

## See Also
VS Functions:
ModifySlab

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural